#include <stdio.h>

    int mian() {

        ; int a = 1 ;     //此处设a=1，用作后续a+、a-、a*、a/、a%时的用量。
        ; a+= 3;          //此处a+= 3意思为用先前a的赋值也就是int a = 1 来带入a并加上“3”，然后将值再导入a.得4
        ; a = a +3;       //a+= 3与a+a +3 同理一致
        ; a++;            //a++本质上等于a=a+1
        ; a-= 2;          //同理得-1
        ; a*= 5;          //同理得5
        ; a/= 2;          //1除2得0.5因整数得0或者四舍五入1
        ; a%= 4;          //1除4余1
        ; int b = a++;    //此时a的值为2，b的值为1；若int b=++a；则b的值会为2
        ; //三目运算符比较法：
        ; int a,b,c;
        ; printf("输入一个数");     
        ; scanf("%d",&a);
        ; printf("第二个数");
        ; scanf("%d",&b);
        ; c = (a > b)? a : b;
        ; printf("a与b中的最大值是%c",c);
        return 0;
    }